In [1]:
import numpy as np
import pandas as pd

In [14]:
df_dict = { "a" : "15.11.2021 19:42 - Emrah : 20",
        "b" : "15.11.2021 21:20 - Serdar: 15",
        "c" : "16.11.2021 08:13 - Ali: 15",
        "d" : "16.11.2021 08:13 - Ayşe: 25"}

df_ser = pd.Series(df_dict)
df_ser

a    15.11.2021 19:42 - Emrah : 20
b    15.11.2021 21:20 - Serdar: 15
c       16.11.2021 08:13 - Ali: 15
d      16.11.2021 08:13 - Ayşe: 25
dtype: object

In [15]:
df_ser = df_ser.str.split(pat="-",expand=True)

In [22]:
df_ser

                   0            1
a  15.11.2021 19:42    Emrah : 20
b  15.11.2021 21:20    Serdar: 15
c  16.11.2021 08:13       Ali: 15
d  16.11.2021 08:13      Ayşe: 25

In [26]:
df_ser2 = df_ser[1].str.split(pat=":",expand=True)
df_ser2

         0    1
a   Emrah    20
b   Serdar   15
c      Ali   15
d     Ayşe   25

In [35]:
pd.concat([df_ser[[0]], df_ser2], axis=1, ignore_index=True)

                   0        1    2
a  15.11.2021 19:42    Emrah    20
b  15.11.2021 21:20    Serdar   15
c  16.11.2021 08:13       Ali   15
d  16.11.2021 08:13      Ayşe   25